InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_PRIOCLR.h
/**
 *
 * @file DMA_RegisterDefines_PRIOCLR.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 28 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 28 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_PRIOCLR_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_PRIOCLR_H_

#include <stdint.h>

/**************************************************************************************
************************************* 19 DMAPRIOCLR *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR0_MASK      ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_R_CLR0_BIT       ((uint32_t)0u)
#define DMA_DMAPRIOCLR_R_CLR0_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR0_CLR       ((uint32_t)0x00000001u)

#define DMA_DMAPRIOCLR_CLR0_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR0_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR0_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR1_MASK      ((uint32_t)0x00000002u)
#define DMA_DMAPRIOCLR_R_CLR1_BIT       ((uint32_t)1u)
#define DMA_DMAPRIOCLR_R_CLR1_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR1_CLR       ((uint32_t)0x00000002u)

#define DMA_DMAPRIOCLR_CLR1_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR1_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR1_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR2_MASK      ((uint32_t)0x00000004u)
#define DMA_DMAPRIOCLR_R_CLR2_BIT       ((uint32_t)2u)
#define DMA_DMAPRIOCLR_R_CLR2_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR2_CLR       ((uint32_t)0x00000004u)

#define DMA_DMAPRIOCLR_CLR2_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR2_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR2_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR3_MASK      ((uint32_t)0x00000008u)
#define DMA_DMAPRIOCLR_R_CLR3_BIT       ((uint32_t)3u)
#define DMA_DMAPRIOCLR_R_CLR3_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR3_CLR       ((uint32_t)0x00000008u)

#define DMA_DMAPRIOCLR_CLR3_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR3_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR3_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR4_MASK      ((uint32_t)0x00000010u)
#define DMA_DMAPRIOCLR_R_CLR4_BIT       ((uint32_t)4u)
#define DMA_DMAPRIOCLR_R_CLR4_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR4_CLR       ((uint32_t)0x00000010u)

#define DMA_DMAPRIOCLR_CLR4_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR4_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR4_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR5_MASK      ((uint32_t)0x00000020u)
#define DMA_DMAPRIOCLR_R_CLR5_BIT       ((uint32_t)5u)
#define DMA_DMAPRIOCLR_R_CLR5_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR5_CLR       ((uint32_t)0x00000020u)

#define DMA_DMAPRIOCLR_CLR5_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR5_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR5_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR6_MASK      ((uint32_t)0x00000040u)
#define DMA_DMAPRIOCLR_R_CLR6_BIT       ((uint32_t)6u)
#define DMA_DMAPRIOCLR_R_CLR6_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR6_CLR       ((uint32_t)0x00000040u)

#define DMA_DMAPRIOCLR_CLR6_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR6_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR6_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR7_MASK      ((uint32_t)0x00000080u)
#define DMA_DMAPRIOCLR_R_CLR7_BIT       ((uint32_t)7u)
#define DMA_DMAPRIOCLR_R_CLR7_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR7_CLR       ((uint32_t)0x00000080u)

#define DMA_DMAPRIOCLR_CLR7_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR7_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR7_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR8_MASK      ((uint32_t)0x00000100u)
#define DMA_DMAPRIOCLR_R_CLR8_BIT       ((uint32_t)8u)
#define DMA_DMAPRIOCLR_R_CLR8_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR8_CLR       ((uint32_t)0x00000100u)

#define DMA_DMAPRIOCLR_CLR8_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR8_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR8_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR9_MASK      ((uint32_t)0x00000200u)
#define DMA_DMAPRIOCLR_R_CLR9_BIT       ((uint32_t)9u)
#define DMA_DMAPRIOCLR_R_CLR9_NA        ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR9_CLR       ((uint32_t)0x00000200u)

#define DMA_DMAPRIOCLR_CLR9_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR9_NA          ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR9_CLR         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR10_MASK     ((uint32_t)0x00000400u)
#define DMA_DMAPRIOCLR_R_CLR10_BIT      ((uint32_t)10u)
#define DMA_DMAPRIOCLR_R_CLR10_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR10_CLR      ((uint32_t)0x00000400u)

#define DMA_DMAPRIOCLR_CLR10_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR10_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR10_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR11_MASK     ((uint32_t)0x00000800u)
#define DMA_DMAPRIOCLR_R_CLR11_BIT      ((uint32_t)11u)
#define DMA_DMAPRIOCLR_R_CLR11_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR11_CLR      ((uint32_t)0x00000800u)

#define DMA_DMAPRIOCLR_CLR11_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR11_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR11_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR12_MASK     ((uint32_t)0x00001000u)
#define DMA_DMAPRIOCLR_R_CLR12_BIT      ((uint32_t)12u)
#define DMA_DMAPRIOCLR_R_CLR12_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR12_CLR      ((uint32_t)0x00001000u)

#define DMA_DMAPRIOCLR_CLR12_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR12_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR12_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR13_MASK     ((uint32_t)0x00002000u)
#define DMA_DMAPRIOCLR_R_CLR13_BIT      ((uint32_t)13u)
#define DMA_DMAPRIOCLR_R_CLR13_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR13_CLR      ((uint32_t)0x00002000u)

#define DMA_DMAPRIOCLR_CLR13_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR13_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR13_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR14_MASK     ((uint32_t)0x00004000u)
#define DMA_DMAPRIOCLR_R_CLR14_BIT      ((uint32_t)14u)
#define DMA_DMAPRIOCLR_R_CLR14_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR14_CLR      ((uint32_t)0x00004000u)

#define DMA_DMAPRIOCLR_CLR14_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR14_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR14_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR15_MASK     ((uint32_t)0x00008000u)
#define DMA_DMAPRIOCLR_R_CLR15_BIT      ((uint32_t)15u)
#define DMA_DMAPRIOCLR_R_CLR15_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR15_CLR      ((uint32_t)0x00008000u)

#define DMA_DMAPRIOCLR_CLR15_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR15_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR15_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR16_MASK     ((uint32_t)0x00010000u)
#define DMA_DMAPRIOCLR_R_CLR16_BIT      ((uint32_t)16u)
#define DMA_DMAPRIOCLR_R_CLR16_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR16_CLR      ((uint32_t)0x00010000u)

#define DMA_DMAPRIOCLR_CLR16_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR16_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR16_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR17_MASK     ((uint32_t)0x00020000u)
#define DMA_DMAPRIOCLR_R_CLR17_BIT      ((uint32_t)17u)
#define DMA_DMAPRIOCLR_R_CLR17_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR17_CLR      ((uint32_t)0x00020000u)

#define DMA_DMAPRIOCLR_CLR17_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR17_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR17_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR18_MASK     ((uint32_t)0x00040000u)
#define DMA_DMAPRIOCLR_R_CLR18_BIT      ((uint32_t)18u)
#define DMA_DMAPRIOCLR_R_CLR18_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR18_CLR      ((uint32_t)0x00040000u)

#define DMA_DMAPRIOCLR_CLR18_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR18_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR18_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR19_MASK     ((uint32_t)0x00080000u)
#define DMA_DMAPRIOCLR_R_CLR19_BIT      ((uint32_t)19u)
#define DMA_DMAPRIOCLR_R_CLR19_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR19_CLR      ((uint32_t)0x00080000u)

#define DMA_DMAPRIOCLR_CLR19_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR19_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR19_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR20_MASK     ((uint32_t)0x00100000u)
#define DMA_DMAPRIOCLR_R_CLR20_BIT      ((uint32_t)20u)
#define DMA_DMAPRIOCLR_R_CLR20_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR20_CLR      ((uint32_t)0x00100000u)

#define DMA_DMAPRIOCLR_CLR20_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR20_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR20_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR21_MASK     ((uint32_t)0x00200000u)
#define DMA_DMAPRIOCLR_R_CLR21_BIT      ((uint32_t)21u)
#define DMA_DMAPRIOCLR_R_CLR21_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR21_CLR      ((uint32_t)0x00200000u)

#define DMA_DMAPRIOCLR_CLR21_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR21_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR21_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR22_MASK     ((uint32_t)0x00400000u)
#define DMA_DMAPRIOCLR_R_CLR22_BIT      ((uint32_t)22u)
#define DMA_DMAPRIOCLR_R_CLR22_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR22_CLR      ((uint32_t)0x00400000u)

#define DMA_DMAPRIOCLR_CLR22_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR22_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR22_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR23_MASK     ((uint32_t)0x00800000u)
#define DMA_DMAPRIOCLR_R_CLR23_BIT      ((uint32_t)23u)
#define DMA_DMAPRIOCLR_R_CLR23_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR23_CLR      ((uint32_t)0x00800000u)

#define DMA_DMAPRIOCLR_CLR23_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR23_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR23_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR24_MASK     ((uint32_t)0x01000000u)
#define DMA_DMAPRIOCLR_R_CLR24_BIT      ((uint32_t)24u)
#define DMA_DMAPRIOCLR_R_CLR24_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR24_CLR      ((uint32_t)0x01000000u)

#define DMA_DMAPRIOCLR_CLR24_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR24_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR24_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR25_MASK     ((uint32_t)0x02000000u)
#define DMA_DMAPRIOCLR_R_CLR25_BIT      ((uint32_t)25u)
#define DMA_DMAPRIOCLR_R_CLR25_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR25_CLR      ((uint32_t)0x02000000u)

#define DMA_DMAPRIOCLR_CLR25_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR25_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR25_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR26_MASK     ((uint32_t)0x04000000u)
#define DMA_DMAPRIOCLR_R_CLR26_BIT      ((uint32_t)26u)
#define DMA_DMAPRIOCLR_R_CLR26_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR26_CLR      ((uint32_t)0x04000000u)

#define DMA_DMAPRIOCLR_CLR26_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR26_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR26_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR27_MASK     ((uint32_t)0x08000000u)
#define DMA_DMAPRIOCLR_R_CLR27_BIT      ((uint32_t)27u)
#define DMA_DMAPRIOCLR_R_CLR27_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR27_CLR      ((uint32_t)0x08000000u)

#define DMA_DMAPRIOCLR_CLR27_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR27_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR27_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR28_MASK     ((uint32_t)0x10000000u)
#define DMA_DMAPRIOCLR_R_CLR28_BIT      ((uint32_t)28u)
#define DMA_DMAPRIOCLR_R_CLR28_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR28_CLR      ((uint32_t)0x10000000u)

#define DMA_DMAPRIOCLR_CLR28_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR28_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR28_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR29_MASK     ((uint32_t)0x20000000u)
#define DMA_DMAPRIOCLR_R_CLR29_BIT      ((uint32_t)29u)
#define DMA_DMAPRIOCLR_R_CLR29_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR29_CLR      ((uint32_t)0x20000000u)

#define DMA_DMAPRIOCLR_CLR29_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR29_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR29_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR30_MASK     ((uint32_t)0x40000000u)
#define DMA_DMAPRIOCLR_R_CLR30_BIT      ((uint32_t)30u)
#define DMA_DMAPRIOCLR_R_CLR30_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR30_CLR      ((uint32_t)0x40000000u)

#define DMA_DMAPRIOCLR_CLR30_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR30_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR30_CLR        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAPRIOCLR_R_CLR31_MASK     ((uint32_t)0x80000000u)
#define DMA_DMAPRIOCLR_R_CLR31_BIT      ((uint32_t)31u)
#define DMA_DMAPRIOCLR_R_CLR31_NA       ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_R_CLR31_CLR      ((uint32_t)0x80000000u)

#define DMA_DMAPRIOCLR_CLR31_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAPRIOCLR_CLR31_NA         ((uint32_t)0x00000000u)
#define DMA_DMAPRIOCLR_CLR31_CLR        ((uint32_t)0x00000001u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_PRIOCLR_H_ */
